# Import Libraries

In [121]:
import pandas as pd
import re

# Read Data

In [122]:
dict_ld = {"liceness_designation":["CFA, 7, 63, CPA","7,63","CFA, 63","CFA"]}

In [123]:
df = pd.DataFrame(dict_ld)

In [124]:
df

  liceness_designation
0      CFA, 7, 63, CPA
1                 7,63
2              CFA, 63
3                  CFA

# Create Licenses Held and Number of Licenses Held

In [127]:
df['liceness_held'] = df['liceness_designation'].str.findall(r'\d+').apply(lambda x: ','.join(x))
df['num_liceness_held'] = df['liceness_designation'].str.findall(r'\d+').apply(lambda x: len(x))

In [128]:
df

  liceness_designation liceness_held  num_liceness_held
0      CFA, 7, 63, CPA          7,63                  2
1                 7,63          7,63                  2
2              CFA, 63            63                  1
3                  CFA                                0

# Create Designation and Number of Designations

In [132]:
df['designation'] = df['liceness_designation']\
.apply(lambda x: ','.join([i.strip() for i in x.split(',') if i.strip().isdigit() == False]))
df['num_designation'] = df['liceness_designation']\
.apply(lambda x: len([i.strip() for i in x.split(',') if i.strip().isdigit() == False]))

In [133]:
df

,liceness_designation,liceness_held,num_liceness_held,designation,num_designation
0,"CFA, 7, 63, CPA","7,63",2,"CFA,CPA",2
1,"7,63","7,63",2,,0
2,"CFA, 63",63,1,CFA,1
3,CFA,,0,CFA,1